#include <stdio.h>

int main() {
    int x = 12, y = 7, z = 12; // กำหนดค่าตัวแปร x = 12, y = 7, z = 12

    printf("1. x > y            = %d\n", x > y);              
    // 12 > 7 เป็นจริง แสดง 1
    printf("2. x < z            = %d\n", x < z);              
    // 12 < 12 เป็นเท็จ แสดง 0

    printf("3. x == z           = %d\n", x == z);             
    // 12 เท่ากับ 12 เป็นจริง แสดง 1
    printf("4. x != y           = %d\n", x != y);             
    // 12 ไม่เท่ากับ 7 เป็นจริง แสดง 1

    printf("5. (2*x >= y) || (5 != (5/3)) = %d\n", (2*x >= y) || (5 != (5/3)));
    // (2*12 = 24 >= 7) เป็นจริงด้านซ้ายเป็น 1
    // (5 != 1) เพราะ 5/3 = 1 แบบ int จริง ด้านขวาเป็น 1
    // จริง || จริง = จริง แสดง 1

    printf("6. !(x < y)         = %d\n", !(x < y));           
    // x < y 12 < 7 เป็นเท็จ !เท็จ = จริง แสดง 1
    printf("7. (x + y) > (z * 2)= %d\n", (x + y) > (z * 2));   
    // x+y = 19, z*2 = 24 19 > 24 เป็นเท็จ แสดง 0

    printf("8. (x %% 2 == 0) || (y %% 2 == 1) = %d\n", (x % 2 == 0) || (y % 2 == 1));
    // x = 12  12%2 = 0 จริง (ซ้ายเป็น 1)
    // y = 7  7%2 = 1 จริง (ขวาเป็น 1)
    // จริง || จริง = จริง แสดง 1

    printf("9. (x > y) && (z < y)= %d\n", (x > y) && (z < y)); 
    // x > y  จริง (12 > 7)
    // z < y  12 < 7 เป็นเท็จ
    // จริง && เท็จ = เท็จ แสดง 0
    return 0;
}
